In [1]:
import pandas as pd

In [2]:
df3 = pd.read_csv(r'D:\CDS CvR sizing2.csv')

In [3]:
df3

          date        mv      aov  session    cvr
0     1-Jan-22  18648340  3225.24   585670  0.99%
1     2-Jan-22  20839549  2941.36   607202  1.17%
2     3-Jan-22  23494702  2834.10   650833  1.27%
3     4-Jan-22  25741442  2739.33   725987  1.29%
4     5-Jan-22  22951120  2768.53   723351  1.15%
..         ...       ...      ...      ...    ...
228  17-Aug-22  19028335  2839.20   658954  1.02%
229  18-Aug-22  17428580  2745.96   629283  1.01%
230  19-Aug-22  22147709  3611.24   647827  0.95%
231  20-Aug-22  17342724  2976.78   576908  1.01%
232  21-Aug-22  16972891  2969.88   552351  1.03%

[233 rows x 5 columns]

In [4]:
df3.dtypes

date        object
mv           int64
aov        float64
session      int64
cvr         object
dtype: object

In [5]:
df3['date'] = pd.to_datetime(df3['date'])

In [6]:
df3.dtypes

date       datetime64[ns]
mv                  int64
aov               float64
session             int64
cvr                object
dtype: object

In [7]:
df3['month'] = df3.date.dt.month

In [8]:
df3

          date        mv      aov  session    cvr  month
0   2022-01-01  18648340  3225.24   585670  0.99%      1
1   2022-01-02  20839549  2941.36   607202  1.17%      1
2   2022-01-03  23494702  2834.10   650833  1.27%      1
3   2022-01-04  25741442  2739.33   725987  1.29%      1
4   2022-01-05  22951120  2768.53   723351  1.15%      1
..         ...       ...      ...      ...    ...    ...
228 2022-08-17  19028335  2839.20   658954  1.02%      8
229 2022-08-18  17428580  2745.96   629283  1.01%      8
230 2022-08-19  22147709  3611.24   647827  0.95%      8
231 2022-08-20  17342724  2976.78   576908  1.01%      8
232 2022-08-21  16972891  2969.88   552351  1.03%      8

[233 rows x 6 columns]

In [9]:
df3.groupby('month')['mv'].agg(['sum'])

             sum
month
1      736193322
2      638853799
3      712420002
4      670007638
5      732725649
6      660350342
7      673658069
8      476981249

In [10]:
#3 output
df3.groupby('month')['mv'].agg(['sum', 'mean', 'std']).sort_values('sum')

             sum          mean           std
month
8      476981249  2.271339e+07  1.192159e+07
2      638853799  2.281621e+07  4.931205e+06
6      660350342  2.201168e+07  9.280530e+06
4      670007638  2.233359e+07  6.968253e+06
7      673658069  2.173091e+07  8.814940e+06
3      712420002  2.298129e+07  7.240373e+06
5      732725649  2.363631e+07  8.547646e+06
1      736193322  2.374817e+07  2.415202e+06

In [11]:
#Write in Chaining method
(df3
 .groupby('month')['mv']
 .agg(['sum', 'mean', 'std'])
 .sort_values('sum')
)

             sum          mean           std
month
8      476981249  2.271339e+07  1.192159e+07
2      638853799  2.281621e+07  4.931205e+06
6      660350342  2.201168e+07  9.280530e+06
4      670007638  2.233359e+07  6.968253e+06
7      673658069  2.173091e+07  8.814940e+06
3      712420002  2.298129e+07  7.240373e+06
5      732725649  2.363631e+07  8.547646e+06
1      736193322  2.374817e+07  2.415202e+06

In [12]:
#sort by descending
(df3
 .groupby('month')['mv']
 .agg(['sum', 'mean', 'std'])
 .sort_values('sum', ascending = False)
)

             sum          mean           std
month
1      736193322  2.374817e+07  2.415202e+06
5      732725649  2.363631e+07  8.547646e+06
3      712420002  2.298129e+07  7.240373e+06
7      673658069  2.173091e+07  8.814940e+06
4      670007638  2.233359e+07  6.968253e+06
6      660350342  2.201168e+07  9.280530e+06
2      638853799  2.281621e+07  4.931205e+06
8      476981249  2.271339e+07  1.192159e+07

In [13]:
df_pivot = (df3
 .groupby('month')['mv']
 .agg(['sum', 'mean', 'std'])
 .sort_values('sum', ascending = False)
)

In [14]:
df_pivot

             sum          mean           std
month
1      736193322  2.374817e+07  2.415202e+06
5      732725649  2.363631e+07  8.547646e+06
3      712420002  2.298129e+07  7.240373e+06
7      673658069  2.173091e+07  8.814940e+06
4      670007638  2.233359e+07  6.968253e+06
6      660350342  2.201168e+07  9.280530e+06
2      638853799  2.281621e+07  4.931205e+06
8      476981249  2.271339e+07  1.192159e+07

In [15]:
#sort 2 columns at the same time
#just turn inside () of sort_values into list [ ]
(df3
 .groupby('month')['mv']
 .agg(['sum', 'mean', 'std'])
 .sort_values(['sum', 'mean'])
)

             sum          mean           std
month
8      476981249  2.271339e+07  1.192159e+07
2      638853799  2.281621e+07  4.931205e+06
6      660350342  2.201168e+07  9.280530e+06
4      670007638  2.233359e+07  6.968253e+06
7      673658069  2.173091e+07  8.814940e+06
3      712420002  2.298129e+07  7.240373e+06
5      732725649  2.363631e+07  8.547646e+06
1      736193322  2.374817e+07  2.415202e+06

In [16]:
#sort2 columns at the same time, one ascending while one descending
(df3
 .groupby('month')['mv']
 .agg(['sum', 'mean', 'std'])
 .sort_values(['sum', 'mean'], ascending = [False, True])
)

             sum          mean           std
month
1      736193322  2.374817e+07  2.415202e+06
5      732725649  2.363631e+07  8.547646e+06
3      712420002  2.298129e+07  7.240373e+06
7      673658069  2.173091e+07  8.814940e+06
4      670007638  2.233359e+07  6.968253e+06
6      660350342  2.201168e+07  9.280530e+06
2      638853799  2.281621e+07  4.931205e+06
8      476981249  2.271339e+07  1.192159e+07

In [17]:
#Facets
import seaborn as sns
from matplotlib import pyplot as plt

In [18]:
#use penguin dataset from seaborn
pg = sns.load_dataset('penguins')

In [19]:
pg

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female
...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,Female
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,Male
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,Female
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,Male

In [20]:
pg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   species            344 non-null    object
 1   island             344 non-null    object
 2   bill_length_mm     342 non-null    float64
 3   bill_depth_mm      342 non-null    float64
 4   flipper_length_mm  342 non-null    float64
 5   body_mass_g        342 non-null    float64
 6   sex                333 non-null    object
dtypes: float64(4), object(3)
memory usage: 18.9+ KB

In [75]:
(pg
 .groupby('island')['bill_length_mm']
 .agg(['mean'])
)

                mean
island
Biscoe     45.257485
Dream      44.167742
Torgersen  38.950980

In [22]:
#if else lesson
a = 2
b = 4
if a < b:
    print('bad')

bad

In [23]:
if a > b:
    print('bad')
print('good')

good

In [24]:
#Prefered way to write if else
if a > b:
    print('bad')
else:
    print('sygoo')

sygoo

In [25]:
#elif, used when having 3 cases
if a < b:
    print('less')
elif a == b:
    print('equal')
else:
    print('higher')

less

In [26]:
a = 3
b = 3
if a < b:
    print('less')
elif a == b:
    print('equal')
else:
    print('higher')

equal

In [27]:
a = 6
b = 3
if a < b:
    print('less')
elif a == b:
    print('equal')
else:
    print('higher')

higher

In [28]:
#multiple elif, use when having > 3 cases
a = 33
b = 3
if a < b:
    print('bad')
elif a == b:
    print('ok')
elif a > (b*10):
    print('wtf')
else:
    print('good')

wtf

In [29]:
#if else within else
a = 3
b = 2
if a < b:
    print('bad')
else:
    if a == b:
        print('ok')
    else:
        print('good')

good

In [30]:
#if elif else within else
a = 300
b = 2
if a < b:
    print('bad')
else:
    if a == b:
        print('ok')
    elif a == b*100:
        print('over')
    else:
        print('good')

good

In [31]:
#if else + print result with example in bmi
name = 'ta'
height = 2
weight = 190

bmi = weight / (height**2)

print('bmi result')
if bmi < 25:
    print(name)
    print('is slim')
else:
    print(name)
    print('is fat')

bmi result
ta
is fat

In [32]:
print('bmi result')
if bmi < 25:
    print(name + ' is slim')
else:
    print(name + ' is fat')

bmi result
ta is fat

In [35]:
#for loop
#doing the same thing over & over to a dataset or list
#Iterate = do something (the same thing) with each item in the list or series

In [36]:
#list a
a = ['banana', 'apple', 'orange']

In [37]:
a

['banana', 'apple', 'orange']

In [40]:
#print all value in the list a
print(a[0])
print(a[1])
print(a[2])

banana
apple
orange

In [42]:
#For loop จะช่วยลดกาารใช้คำสั่งซ้ำๆ
for i in a:
    print(i)
#ตรง i สามารถเรียกว่าอะไรก้ได้แต่ต้องเรียกเหมือนกันทั้งตรง for และตรงคำสั่ง print

banana
apple
orange

In [61]:
b = [1, 2, 3]

In [62]:
b

[1, 2, 3]

In [63]:
#find the sum of b
total = 0
for i in b:
    total = total + i
print(total)

6

In [64]:
#Other way tp write code
total2 = 0
for i in b:
    total2 += i
print(total2)

6

In [51]:
for i in b:
    b = i*2
print(b)

6

In [52]:
#create a range of number using range() (but not include the last number) then convert into list
range(1,99)

range(1, 99)

In [55]:
c = list(range(1, 10))

In [56]:
print(c)

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [71]:
#using range in for loop
for i in range(1, 10):
    print(i)

1
2
3
4
5
6
7
8
9

In [74]:
#create range ที่ค่าเิ่มจากมากไปน้อย
backward_c = list(range(6, 0, -1))
#6 คือค่าเริ่มต้น 0 คือค่าสุดท้ายที่จะไม่ถูกรวมใน list  ส่วน -1 คือบอกว่าให้ค่าเรียงจากมากไปน้อย
backward_c

[6, 5, 4, 3, 2, 1]

In [66]:
#add value to the list with .append()
b = []
b.append(1)
b.append(2)
b

[1, 2]

In [67]:
#use for loop & append.() to create new list from existing list
#create list c, which the values in list c is *2 of values in list a
a = [1, 2, 3, 4]

#create list c
c = []
for i in a:
    c.append(i * 2)
c

[2, 4, 6, 8]

In [68]:
#list comprehension คือการทำ operation เดียวกันกับทั้ง lisr or series or dataframe
#สรุป list comprehension ก้คือการทำ for loop ใน list นั่นแหละ
#มี  3 chunks in list comprehension 1. function part 2. condition part 3. for loop part(which dataset we need to loop)
#so list comprehension can replace for loop
#create list d to be like list c above, using value from list a as a start
d = [i * 2 for i in a]
d
#ตรงก่อนหน้า for สามารถใส่เป็น operation (+ - * /) หรือ function ก็ได้

[2, 4, 6, 8]

In [70]:
#can also calculate list comprehension using range instead of existing list
e = [i ** 2 for i in range(1, 10)]
e

[1, 4, 9, 16, 25, 36, 49, 64, 81]

In [76]:
#aaply condition on real dataset
#1 condition, use np.where() 
df_pivot

             sum          mean           std
month
1      736193322  2.374817e+07  2.415202e+06
5      732725649  2.363631e+07  8.547646e+06
3      712420002  2.298129e+07  7.240373e+06
7      673658069  2.173091e+07  8.814940e+06
4      670007638  2.233359e+07  6.968253e+06
6      660350342  2.201168e+07  9.280530e+06
2      638853799  2.281621e+07  4.931205e+06
8      476981249  2.271339e+07  1.192159e+07

In [83]:
import numpy as np
df_pivot['condition'] = np.where(
    df_pivot['sum'] > 700000000, 
    'good', 
    'bad')
#1 = condition
#2 = ให้ใส่ค่าว่าอะไรถ้า condition เป็นจริง **สามารถใส่เป็น df['column name'] ได้เพื่อให้แทนค่าตามค่าใน column name นั้น
#3 = ให้ใส่ค่าว่าอะไรถ้าไม่ ทeet condition

In [84]:
df_pivot

             sum          mean           std condition
month
1      736193322  2.374817e+07  2.415202e+06      good
5      732725649  2.363631e+07  8.547646e+06      good
3      712420002  2.298129e+07  7.240373e+06      good
7      673658069  2.173091e+07  8.814940e+06       bad
4      670007638  2.233359e+07  6.968253e+06       bad
6      660350342  2.201168e+07  9.280530e+06       bad
2      638853799  2.281621e+07  4.931205e+06       bad
8      476981249  2.271339e+07  1.192159e+07       bad

In [87]:
#2 or more condition, use np.select()
#โดยสิ่งที่จะใส่ใน np.select() คือ list ไม่ใช่ value เลยต้องสร้าง list ของ 2 things 1. condition 2.results 
detailed_condition = [
    (df_pivot['sum'] >= 700000000),
    (df_pivot['sum'] < 700000000) & (df_pivot['sum'] >= 670000000),
    (df_pivot['sum'] < 670000000) & (df_pivot['sum'] >= 650000000),
    (df_pivot['sum'] < 650000000) & (df_pivot['sum'] >= 630000000),
    (df_pivot['sum'] < 630000000)    
]

result = ['a', 'b', 'c', 'd', 'f']

In [88]:
df_pivot['grade'] = np.select(detailed_condition, result, default = 'not_graded')
#a = condition **สามารถผสม condition ได้หลาย column ตามใน cap screen
#b = result matching with condition **สามารถใส่เป็น df['column name'] ได้เพื่อให้แทนค่าตามค่าใน column name นั้น
#default = ให้แทนค่าว่าอะไรถ้าค่าไม่ตรงตาม condition ไหนเลย

In [89]:
df_pivot

             sum          mean           std condition grade
month
1      736193322  2.374817e+07  2.415202e+06      good     a
5      732725649  2.363631e+07  8.547646e+06      good     a
3      712420002  2.298129e+07  7.240373e+06      good     a
7      673658069  2.173091e+07  8.814940e+06       bad     b
4      670007638  2.233359e+07  6.968253e+06       bad     b
6      660350342  2.201168e+07  9.280530e+06       bad     c
2      638853799  2.281621e+07  4.931205e+06       bad     d
8      476981249  2.271339e+07  1.192159e+07       bad     f

In [90]:
#but the above method is too redundant, use list comprehention instead for both single and many conditions!!
df_pivot['condition_2'] = ['good' if i >= 700000000 else 'bad' for i in df_pivot['sum']]

In [91]:
df_pivot

             sum          mean           std condition grade condition_2
month
1      736193322  2.374817e+07  2.415202e+06      good     a        good
5      732725649  2.363631e+07  8.547646e+06      good     a        good
3      712420002  2.298129e+07  7.240373e+06      good     a        good
7      673658069  2.173091e+07  8.814940e+06       bad     b         bad
4      670007638  2.233359e+07  6.968253e+06       bad     b         bad
6      660350342  2.201168e+07  9.280530e+06       bad     c         bad
2      638853799  2.281621e+07  4.931205e+06       bad     d         bad
8      476981249  2.271339e+07  1.192159e+07       bad     f         bad

In [92]:
#same code with condition_2 but cleaner way to write
df_pivot['condition_3'] = [
    'good' if i >= 700000000 
    else 'bad' 
    for i in df_pivot['sum']
]

In [93]:
df_pivot

,sum,mean,std,condition,grade,condition_2,condition_3
month,,,,,,,
1,736193322,2.374817e+07,2.415202e+06,good,a,good,good
5,732725649,2.363631e+07,8.547646e+06,good,a,good,good
3,712420002,2.298129e+07,7.240373e+06,good,a,good,good
7,673658069,2.173091e+07,8.814940e+06,bad,b,bad,bad
4,670007638,2.233359e+07,6.968253e+06,bad,b,bad,bad
6,660350342,2.201168e+07,9.280530e+06,bad,c,bad,bad
2,638853799,2.281621e+07,4.931205e+06,bad,d,bad,bad
8,476981249,2.271339e+07,1.192159e+07,bad,f,bad,bad